# ConnectorAngle Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ConnectorAngle Property
ParameterTypeId Class See Also
---
"Angle"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ConnectorAngle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConnectorAngle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ConnectorAngle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace